#include <iostream>
#include "bank.h"

using namespace std;


int main(int argc, char* argv[])
{
    cout << "                             --- THE PROGRAM STARTED ---                                 " << endl ;

	cout << endl << "-----------------------------------------------------------------------------------------------------------------------------" << endl << endl ;
	cout << "                       A. Nα δημιουργεί μια τράπεζα." << endl;
	cout << endl << "-----------------------------------------------------------------------------------------------------------------------------" << endl << endl ;

	int K = stoi(argv[1]), M = stoi(argv[2]), N = stoi(argv[3]), L = stoi(argv[4]);

    cout << "K = " << K << " M = " << M << " N = " << N << " L = " << L << endl;
	Bank bank(L, K);

	// cout << endl << "-----------------------------------------------------------------------------------------------------------------------------" << endl << endl ;
	// cout << "                       Β. Να δημιουργεί " << L << " βιβλία." << endl;
	// cout << endl << "-----------------------------------------------------------------------------------------------------------------------------" << endl << endl ;
	
	// Book *book[L];

	// for(int i = 0; i < L; i++)
	// {
	// 	book[i] = new Book("title" + to_string(i), "nameSurenameOfAuthor" + to_string(i), i);
	// }


	// cout << endl << "-----------------------------------------------------------------------------------------------------------------------------" << endl << endl ;
	// cout << "                       Γ. Να πραγματοποιεί " << K1 << " τυχαίες τοποθετήσεις βιβλίων στη βιβλιοθήκη." << endl;
	// cout << endl << "-----------------------------------------------------------------------------------------------------------------------------" << endl << endl ;


	// int numberOfBooksToPlace = L;
	// if(L > K1)
	// {
	// 	numberOfBooksToPlace = K1;
	// }
	// else if(L < K1)
	// {
	// 	cout << "ERROR : You want to place " << K1 << " books, but you have " << L << " books. So " << L << " books will be placed." << endl;
	// }
	
	// srand((unsigned) time(0));

	// for(int i = 0; i < numberOfBooksToPlace; i++)
	// {
	// 	int randomShelf = rand() % (5) + 1;
	// 	bookCase.place_book(randomShelf, *book[i]);
	// }

	// cout << endl << "-----------------------------------------------------------------------------------------------------------------------------" << endl << endl ;
	// cout << "                       Δ. Να πραγματοποιεί " << K2 << " τυχαίες αϕαιρέσεις βιβλίων στη βιβλιοθήκη." << endl;
	// cout << endl << "-----------------------------------------------------------------------------------------------------------------------------" << endl << endl ;

	// for(int i = 0; i < K2; i++)
	// {
	// 	int randomShelf = rand() % (5) + 1;
	// 	bookCase.take_book(randomShelf);
	// }

	// cout << endl << "-----------------------------------------------------------------------------------------------------------------------------" << endl << endl ;
	// cout << "                       Ε. Να κάνει εκτύπωση στην βιβλιοθήκη" << endl;
	// cout << endl << "-----------------------------------------------------------------------------------------------------------------------------" << endl << endl ;

	// bookCase.print();
	
	// // Deleting Books 
	// for(int i = 0; i < L; i++)
	// {
	// 	delete book[i];
	// }

	cout << "                             --- THE PROGRAM ENDED ---                                 " << endl << endl ;
	return 0;
}